Tekla.Structures.Analysis.AnalysisConnectivity.ConnectivityEnum
The connectivity types.

Tekla.Structures.Analysis.AnalysisConnectivity.ConnectivityEnum.CONNECTIVITY_FIXED
The connectivity is fixed.

Tekla.Structures.Analysis.AnalysisConnectivity.ConnectivityEnum.CONNECTIVITY_FREE
The connectivity is free.

Tekla.Structures.Analysis.AnalysisConnectivity.ConnectivityEnum.CONNECTIVITY_SPRING
The connectivity is a spring.

Tekla.Structures.Analysis.AnalysisConnectivity.ConnectivityEnum.CONNECTIVITY_PARTIAL_RELEASE
The connectivity is partially released.